Белгипрозем_2017/src/Catalogs/ПравилаАвтозаполненияФайлов/ПравилаАвтозаполненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаАвтозаполненияФайлов</name>
  <comment>Справочник правил автозаполнения шаблонов файлов</comment>
  <attributes>
    <name>ВладелецФайла</name>
    <comment>Вид документа, для которого указывается настройка автозаполнения</comment>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонФайла</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеДляАвтозаполнения</name>
    <attributes>
      <name>ТермДляЗамены</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменяемаяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗамены</name>
      <comment>Реквизит владельца файла, значение которого подставляется вместо терма для замены</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыражениеОбработкиРезультатаЗамены</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФорматЗначенияЗамены</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияЗамены</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаЗаполненияТаблиц</name>
    <attributes>
      <name>ЗаполняемаяТаблица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменяемоеПоле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаменыРеквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеЗаменыВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникДанныхДляЗамены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/ПравилаАвтозаполненияФайлов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей ПравилаАвтозаполненияШаблоновФайлов
//
// Возвращаемое значение:
//   Структура
//
Функция ПолучитьСтруктуруПравилаАвтозаполнения() Экспорт
	
	ПараметрыПравила = Новый Структура;
	ПараметрыПравила.Вставить("Наименование");
	ПараметрыПравила.Вставить("ВладелецФайла");
	ПараметрыПравила.Вставить("ШаблонФайла");
	ПараметрыПравила.Вставить("Ответственный");
	ПараметрыПравила.Вставить("Комментарий");
	
	ДанныеДляАвтозаполнения = Новый ТаблицаЗначений;
	ДанныеДляАвтозаполнения.Колонки.Добавить("ТермДляЗамены");
	ДанныеДляАвтозаполнения.Колонки.Добавить("ЗаменяемаяСтрока");
	ДанныеДляАвтозаполнения.Колонки.Добавить("ЗначениеЗамены");
	ДанныеДляАвтозаполнения.Колонки.Добавить("ВыражениеОбработкиРезультатаЗамены");
	ДанныеДляАвтозаполнения.Колонки.Добавить("ФорматЗначенияЗамены");
	ДанныеДляАвтозаполнения.Колонки.Добавить("ТипЗначенияЗамены");
	ПараметрыПравила.Вставить("ДанныеДляАвтозаполнения", ДанныеДляАвтозаполнения);
	
	Возврат ПараметрыПравила;
	
КонецФункции

// Создает и записывает в БД правило автозаполнения
//
// Параметры:
//   ПараметрыПравила - Структура - структура полей правила автозаполнения шаблонов файлов.
//
Функция СоздатьПравилоАвтозаполнения(СтруктураПравила) Экспорт
	
	НовоеПравило = Справочники.ПравилаАвтозаполненияФайлов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовоеПравило, СтруктураПравила);
	Для Каждого Строка Из СтруктураПравила.ДанныеДляАвтозаполнения Цикл
		НоваяСтрока = НовоеПравило.ДанныеДляАвтозаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	НовоеПравило.Записать();
	
	Возврат НовоеПравило.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
